# GetTransformed Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GeometryElement..::..GetTransformed Method
GeometryElement Class See Also
---
Returns a transformed copy of the geometry in this element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public GeometryElement GetTransformed(
	Transform transform
)
```

Visual Basic
---
```text
Public Function GetTransformed ( _
	transform As Transform _
) As GeometryElement
```

Visual C++
---
```text
public:
GeometryElement^ GetTransformed(
	Transform^ transform
)
```

# ### Parameters
transform
    Type: Autodesk.Revit.DB..::..TransformThe transformation to apply to the geometry.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Transform is not conformal |

# See Also
GeometryElement Class
Autodesk.Revit.DB Namespace